{
  "homepage": "https://github.com/Stormwind99/FoodFunk",
  "promos": {
    "1.12.2-latest": "4.9.3",
    "1.12.2-recommended": "4.9.3"
  },
  "1.12.2": {
    "4.9.3": "Attempted AppleCore compat workarounds",
    "4.9.2": "Load after AppleCore to avoid first start crash",
    "4.9.1": "Added rotMergeRecipe config option.\nNew logo.",
    "4.9.0": "Fix for ConcurrentModificationException exception",
    "4.8.0": "Forge update to 2772",
    "4.7.0": "Library update",
    "4.6.1": "Defensive symbol separation for Hwyla/Waila and TheOneProbe support",
    "4.6.0": "Seed food crops remember rot at age=0.\nSupport for crop age in namekeys - like \"minecraft:carrot[age=7]\".\nRare insta-rot fix.\nRot item merge recipe works in other dimensions.\nOther fixes.",
    "4.5.1": "Fixes for near beginning of time and recrafting rottables.",
    "4.5.0": "Basic support for Waila, Hwyla, and TheOneProbe",
    "4.4.0": "Rotten food heal amount, saturation, mob effect, duration, and probability configurable.",
    "4.3.1": "Workaround to fix jar signing",
    "4.3.0": "Basic versions of Larder Box and Icebox. Eliminated ItemStack forceUpdate hack to improve stacking. Rottable item merge recipe.",
    "4.2.0": "Melons rot! Crafted melons inherit rot of ingredients. Support for TileEntities/Blocks and Entities.",
    "4.1.0": "Abstracted base capabilities into WumpleUtil and switched to using them.",
    "4.0.5": "Another getRotProperty NPE fix",
    "4.0.4": "getRotProperty NPE fix",
    "4.0.3": "Improvements to stacking by chunking creation time.  Libraries updated.",
    "4.0.2": "Signing jar file.",
    "4.0.1": "Fix for strange tooltips on composting items in new worlds with Composter mod",
    "4.0.0": "Dimension modifiers - things rot faster in the Nether, and not at all in the End!",
    "3.0.0": "Added support for making Entities like MinecartChest and even entity:player as preserving containers.  Negative-preserving containers.  Advancements.  Rotted item and biodegradable item for modpack authors.  Preserving containers refresh items within IItemHandler items.  OreDict usage.  Evaluation interval configurable.",
    "2.1.2": "Removed dependency on trove library since latest Forge snapshots remove it.  Some file re-org.",
    "2.1.1": "Added cold, frozen, etc tooltips in preserving containers.  Added tooltip text colors.",
    "2.1.0": "Refactoring, optimization, and cleanup.",
    "2.0.6": "Mod compat workaround for RotStorage crash",
    "2.0.5": "Config support for metadata and ore dictionary",
    "2.0.4": "IItemHandler support. Mod compat improvements.  Chinese translation.",
    "2.0.3": "Potential mod init incompatibility workarounds",
    "2.0.2": "Tooltip sync fixes.  Bulk capability container update fix.  More tooltips.",
    "2.0.1": "Server crash fixes, optizations, tooltip fixes",
    "2.0.0": "Rotting and Preserving now implemented with capabilities.  Any container can be made preserving in config.",
    "1.0.4": "Fix dedicated server crash, and added more default config safety",
    "1.0.3": "Fixed another config default crash when other mods remove vanilla items",
    "1.0.2": "Fixed config default crash when other mods remove vanilla items",
    "1.0.1": "Refactoring",
    "1.0.0": "Intial version - ported feature from EnviroMine"
  }
}
